opengl_coordinate.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ch" xml:lang="ch">
<head>
<title>创建坐标系</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="创建坐标系"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-10-18 14:49:18 CST"/>
<meta name="author" content="Joseph Pan"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="./other/style.css" type="text/css"/>

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="./opengl_index.html"> UP </a>
 |
 <a accesskey="H" href="./index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">创建坐标系</h1>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 正投影</a></li>
<li><a href="#sec-2">2 透视投影</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 正投影</h2>
<div class="outline-text-2" id="text-1">


<p>
  我们通常在2D绘图中使用正投影，并在我们的几何图形中将z坐标设为0.0。但是，z轴可以延伸到任何我们想要的长度。我们可以定义一个视景体，这个视景体将包括所有的几何图形。如果我们指定了视景体之外的几何图形，那么它就会被裁剪掉，也就是说，它将被沿着视景体的边界进行剪切。
</p>
<p>  
  在正投影中，所有在这个空间范围内的所有东西都会被显示在屏幕上，而不存在照相机或视点坐标系的概念。我们通过GLFrustum方法来完成上述工作。
</p>




<pre class="src src-c">GLFrustum::SetOrthographic(<span style="color: #00ffff; font-weight: bold;">GLfloat</span> <span style="color: #ffd700; font-style: italic;">xMin</span>, <span style="color: #00ffff; font-weight: bold;">GLfloat</span> <span style="color: #ffd700; font-style: italic;">xMax</span>, <span style="color: #00ffff; font-weight: bold;">GLfloat</span> <span style="color: #ffd700; font-style: italic;">yMin</span>,
                           <span style="color: #00ffff; font-weight: bold;">GLfloat</span> <span style="color: #ffd700; font-style: italic;">yMax</span>, <span style="color: #00ffff; font-weight: bold;">GLfloat</span> <span style="color: #ffd700; font-style: italic;">zMin</span>, <span style="color: #00ffff; font-weight: bold;">GLfloat</span> <span style="color: #ffd700; font-style: italic;">zMax</span>);
</pre>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 透视投影</h2>
<div class="outline-text-2" id="text-2">



<p>
  GLFrustum类通过调用一个SetPerspective方法为我们构建一个平截头体。
</p>



<pre class="src src-c">GLFrustum::SetPerspective(<span style="color: #00ffff; font-weight: bold;">float</span> <span style="color: #ffd700; font-style: italic;">fFov</span>, <span style="color: #00ffff; font-weight: bold;">float</span> <span style="color: #ffd700; font-style: italic;">fAspect</span>, <span style="color: #00ffff; font-weight: bold;">float</span> <span style="color: #ffd700; font-style: italic;">fNear</span>, <span style="color: #00ffff; font-weight: bold;">float</span> <span style="color: #ffd700; font-style: italic;">fFar</span>);
</pre>


<p>
  其中的参数分别在垂直方向向上的视场角度，窗口的宽度与高度的纵横比，以及到近裁剪面和远裁剪面之间的距离。我们用宽度除以高度就能得到窗口或视口的纵横比。
</p></div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-10-18 14:49:18 CST</p>
<p class="author">Author: Joseph Pan</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
